party11 = 'Как стало известно "Совершенно секретно", партия власти всерьёз намерена "засучить рукава'
party12 = 'СПС ― самая либеральная партия, самая далёкая от традиционных ценностей, самая авангардистская во всех отношениях'
party21 = 'К середине дня уже готова и порционно упакована в картонные коробочки первая партия полного ассортимента блюд'
party22 = 'Опытная партия этой обуви была испытана российскими солдатами уже в Первую мировую'

lemma11 = ['власть']
lemma12 = ['либеральный']
lemma21 = ['ассортимент']
lemma22 = ['обувь']

#Взяты на расстоянии 1-3 друг от друга в обоих порядках

freq11_12 = 10995/283431966
freq11_21 = 0/283431966
freq11_22 = 0/283431966
freq12_21 = 0/283431966
freq12_22 = 0/283431966
freq21_22 = 7/283431966

freq11 = 32406/283431966
freq12 = 548/283431966
freq21 = 1040/283431966
freq22 = 2870/283431966

dice11_12 = 2*freq11_12/(freq11 + freq12)
dice11_21 = 2*freq11_21/(freq11 + freq21)
dice11_22 = 2*freq11_22/(freq11 + freq22)
dice12_21 = 2*freq12_21/(freq12 + freq21)
dice12_22 = 2*freq12_22/(freq12 + freq22)
dice21_22 = 2*freq21_22/(freq21 + freq22)

dices = sorted([(dice11_12, party11, party12),
                (dice11_21, party11, party21),
                (dice11_22, party11, party22),
                (dice12_21, party12, party21),
                (dice12_22, party12, party22),
                (dice21_22, party21, party22)], reverse = True)
for a in dices:
    print('индекс Дайса')
    for b in a:
        print(b)
    print('####')
